{
  "backend/main.mo": "Main Motoko canister defining types and storage maps for classes, courses, students, teachers, lessons, subscriptions, and access control with helper authorization functions.",
  "feature_evidence.json": "Empty feature evidence report JSON structure.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for various frontend source files.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables, light/dark styles, and base utilities.",
  "frontend/index.html": "HTML entry point loading the root element and main React script.",
  "frontend/src/App.tsx": "Main React router and app layout configuration integrating authentication, theme, i18n, and all admin, student, and teacher routes.",
  "frontend/src/components/admin/ClassSubscriptionSettingsDialog.tsx": "Dialog component for configuring class subscription paywall, price, and QR code upload.",
  "frontend/src/components/auth/LoginButton.tsx": "Button handling login/logout via Internet Identity with loading states.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog for first‑time user profile creation with name input and backend save mutation.",
  "frontend/src/components/auth/RoleGate.tsx": "Role‑based access wrapper displaying loading or denial states based on user role.",
  "frontend/src/components/common/EmptyStateCard.tsx": "Reusable card component for displaying an empty state with optional icon, description, and action button.",
  "frontend/src/components/common/LanguageToggle.tsx": "Button that switches app language between English and Hindi.",
  "frontend/src/components/common/States.tsx": "Provides loading, error, empty, and access-denied UI state components.",
  "frontend/src/components/layout/AdminNav.tsx": "Admin sidebar navigation with grouped sections and route-aware active states.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with header, sidebar, role-based navigation, and footer.",
  "frontend/src/components/layout/StudentNav.tsx": "Student dashboard navigation listing all student-specific routes.",
  "frontend/src/components/layout/TeacherNav.tsx": "Teacher dashboard navigation listing all teacher-specific routes.",
  "frontend/src/components/student/SubscriptionPaywallCard.tsx": "Paywall card handling subscription status, payment claims, and QR-based payment instructions.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches current user profile, roles, and related student/teacher profiles using React Query and identity state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on classes, courses, students, and lessons via the backend actor.",
  "frontend/src/hooks/useSubscriptions.ts": "Implements subscription-related queries and mutations plus local storage payment-claim handling for classes.",
  "frontend/src/i18n/I18nProvider.tsx": "Sets up a translation context with language persistence and a lookup-based translation function.",
  "frontend/src/i18n/translations.ts": "Contains English and Hindi translation dictionaries and related types.",
  "frontend/src/index.css": "Tailwind CSS base setup with custom light/dark theme variables for the app palette.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/admin/AdmissionsPage.tsx": "Admin-only admissions page displaying a coming-soon empty state.",
  "frontend/src/pages/admin/AttendancePage.tsx": "Admin page showing an empty state for future attendance management features.",
  "frontend/src/pages/admin/AuditLogPage.tsx": "Admin page displaying a coming-soon placeholder for system audit logs.",
  "frontend/src/pages/admin/CertificatesAdminPage.tsx": "Admin interface placeholder for uploading and managing student certificates.",
  "frontend/src/pages/admin/ClassesCoursesPage.tsx": "Admin page for viewing, creating, and managing classes, courses, and subscription settings.",
  "frontend/src/pages/admin/DashboardPage.tsx": "Admin dashboard with navigational cards linking to major management sections.",
  "frontend/src/pages/admin/DemoDataPage.tsx": "Admin tool to generate demo classes, courses, students, and a lesson unless data already exists.",
  "frontend/src/pages/admin/ExpensesPage.tsx": "Admin placeholder page for tracking and managing institute expenses.",
  "frontend/src/pages/admin/FeesPage.tsx": "Admin interface to review and approve pending student payment claims.",
  "frontend/src/pages/admin/HomeworkPage.tsx": "Admin placeholder for homework assignment and submission management.",
  "frontend/src/pages/admin/LeaveRequestsAdminPage.tsx": "Admin placeholder page for reviewing and approving staff leave requests.",
  "frontend/src/pages/admin/LiveClassesPage.tsx": "Admin page showing a coming-soon placeholder for managing live class sessions.",
  "frontend/src/pages/admin/MaterialsPage.tsx": "Admin page with a coming-soon state for uploading and managing study materials.",
  "frontend/src/pages/admin/NotificationsAdminPage.tsx": "Admin page placeholder for creating and sending notifications.",
  "frontend/src/pages/admin/ProgressPage.tsx": "Admin page to view student progress with student selection and lesson completion stats.",
  "frontend/src/pages/admin/RecordedLessonsPage.tsx": "Admin interface for filtering, viewing, and creating recorded lessons with a lesson creation dialog.",
  "frontend/src/pages/admin/ResultsPage.tsx": "Admin page showing a placeholder for viewing test results and analytics.",
  "frontend/src/pages/admin/SalaryLogsPage.tsx": "Admin page placeholder for managing staff salary logs.",
  "frontend/src/pages/admin/StaffManagementPage.tsx": "Admin page showing a coming-soon state for staff management.",
  "frontend/src/pages/admin/StudentIdCardsPage.tsx": "Admin page placeholder for generating student ID cards.",
  "frontend/src/pages/admin/StudentsPage.tsx": "Admin page for listing, filtering, and registering students with a modal form.",
  "frontend/src/pages/admin/TestSeriesPage.tsx": "Admin page placeholder for creating and managing test series.",
  "frontend/src/pages/admin/TimetablePage.tsx": "Admin page showing a coming-soon state for timetable and holiday management.",
  "frontend/src/pages/student/MyAttendancePage.tsx": "Student page placeholder for viewing personal attendance records.",
  "frontend/src/pages/student/MyCertificatesPage.tsx": "Displays a student-only page showing an empty state for certificates.",
  "frontend/src/pages/student/MyFeesPage.tsx": "Student page showing an empty state for fee information and payment history.",
  "frontend/src/pages/student/MyHomeworkPage.tsx": "Shows a homework page for students with an empty state for assignments.",
  "frontend/src/pages/student/MyIdCardPage.tsx": "Provides a student ID card view with a coming-soon empty state.",
  "frontend/src/pages/student/MyLessonsPage.tsx": "Loads lessons, progress, and subscription data, displaying lessons with lock/paywall logic.",
  "frontend/src/pages/student/MyLiveClassesPage.tsx": "Shows an empty-state page for upcoming and past live classes.",
  "frontend/src/pages/student/MyMaterialsPage.tsx": "Displays a student materials page with an empty state for study materials.",
  "frontend/src/pages/student/MyNotificationsPage.tsx": "Shows a notifications page with an empty state for announcements.",
  "frontend/src/pages/student/MyProgressPage.tsx": "Calculates and displays lesson progress stats with a detailed progress list.",
  "frontend/src/pages/student/MyResultsPage.tsx": "Shows an empty state for student test results.",
  "frontend/src/pages/student/MyTestsPage.tsx": "Provides a student tests page with an empty state for assigned tests.",
  "frontend/src/pages/student/MyTimetablePage.tsx": "Displays an empty-state timetable for student schedules.",
  "frontend/src/pages/student/PortalHomePage.tsx": "Student dashboard offering quick links to key sections like lessons, fees, tests, and results.",
  "frontend/src/pages/teacher/AttendancePage.tsx": "Teacher-only page showing a coming-soon empty state for attendance marking.",
  "frontend/src/pages/teacher/DashboardPage.tsx": "Teacher dashboard showing quick links to major teacher functions with navigation.",
  "frontend/src/pages/teacher/HomeworkPage.tsx": "Homework page with a placeholder state for assigning and reviewing homework.",
  "frontend/src/pages/teacher/LiveClassesPage.tsx": "Live classes page showing a coming-soon placeholder for scheduling sessions.",
  "frontend/src/pages/teacher/MaterialsPage.tsx": "Materials page providing a placeholder for uploading study materials.",
  "frontend/src/pages/teacher/MyLeaveRequestsPage.tsx": "Leave requests page displaying an empty state for a teacher's leave history.",
  "frontend/src/pages/teacher/MySalaryPage.tsx": "Salary page showing an empty state for viewing salary records.",
  "frontend/src/pages/teacher/NotificationsPage.tsx": "Notifications page showing an empty state for teacher announcements.",
  "frontend/src/pages/teacher/TestsPage.tsx": "Tests management page with a placeholder for creating and grading tests.",
  "frontend/src/pages/teacher/TimetablePage.tsx": "Timetable page showing an empty state for a teacher's schedule.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theming, colors, animations, and plugins.",
  "project_state.json": "Project state file tracking schema, issues, and pending feature requests for deployment and URL visibility."
}